Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/google v6.42.0

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

[0m[1mgoogle_compute_instance.rocky_vms: Refreshing state... [id=projects/tonal-benefit-462606-b8/zones/asia-southeast1-a/instances/rocky-vm2][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # google_compute_instance.rocky_vms[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "google_compute_instance" "rocky_vms" {
      [31m-[0m [0m[1m[0mcan_ip_forward[0m[0m       = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcpu_platform[0m[0m         = "Intel Broadwell" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m   = "2025-07-04T03:42:01.273-07:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcurrent_status[0m[0m       = "RUNNING" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdeletion_protection[0m[0m  = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0meffective_labels[0m[0m     = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_display[0m[0m       = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                   = "projects/tonal-benefit-462606-b8/zones/asia-southeast1-a/instances/rocky-vm2" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0minstance_id[0m[0m          = "2865336530640703767" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mlabel_fingerprint[0m[0m    = "vezUS-42LLM=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmachine_type[0m[0m         = "e2-medium" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmetadata[0m[0m             = {
          [31m-[0m [0m"ssh-keys" = <<-EOT
                penumarthigeetasri:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC5KYvAzc02uMX0vINcDeCekaUxMHS9kwVcC6qnLNOOHKfpYpXwUZu+NTF1o77X+U2y3nF/VB+vNmxgnh/30YbiAC375NLSpDQtfLBCAlzGaoK/iXHcaocUsgVk03nmN1NdqmAjz3OqErm9N/bqISOLtL3onSji2sMIHKz8dMSb/Svbwlo7SAi34GxD4bZL1FJo9/6KuR1s1YFAkooPUt8YWorgWgSHYY8kOOBxE9p5aEsIJ312rds/NpKp5nm/dAZdwvvRm1r4SF0xx5bCYOVA25/42jOEY5qJPPOoEItwPNmWwU2zFwfG7k58SEqmz5+McNb1fgd6AnTIw1yBx5zn penumarthigeeta@Penumarthis-MacBook-Pro.local
            EOT
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmetadata_fingerprint[0m[0m = "9lMqO7CxuJI=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                 = "rocky-vm2" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m              = "tonal-benefit-462606-b8" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m            = "https://www.googleapis.com/compute/v1/projects/tonal-benefit-462606-b8/zones/asia-southeast1-a/instances/rocky-vm2" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                 = [
          [31m-[0m [0m"http-server",
          [31m-[0m [0m"https-server",
          [31m-[0m [0m"rocky",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags_fingerprint[0m[0m     = "y1kxyI0eZdI=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mterraform_labels[0m[0m     = {
          [31m-[0m [0m"goog-terraform-provisioned" = "true"
        } [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mzone[0m[0m                 = "asia-southeast1-a" [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mboot_disk {
          [31m-[0m [0m[1m[0mauto_delete[0m[0m       = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mdevice_name[0m[0m       = "persistent-disk-0" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mforce_attach[0m[0m      = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mguest_os_features[0m[0m = [
              [31m-[0m [0m"UEFI_COMPATIBLE",
              [31m-[0m [0m"VIRTIO_SCSI_MULTIQUEUE",
              [31m-[0m [0m"GVNIC",
              [31m-[0m [0m"SEV_CAPABLE",
              [31m-[0m [0m"SEV_SNP_CAPABLE",
              [31m-[0m [0m"SEV_LIVE_MIGRATABLE",
              [31m-[0m [0m"SEV_LIVE_MIGRATABLE_V2",
              [31m-[0m [0m"IDPF",
            ] [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmode[0m[0m              = "READ_WRITE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msource[0m[0m            = "https://www.googleapis.com/compute/v1/projects/tonal-benefit-462606-b8/zones/asia-southeast1-a/disks/rocky-vm2" [90m->[0m [0m[90mnull[0m[0m

          [31m-[0m [0minitialize_params {
              [31m-[0m [0m[1m[0marchitecture[0m[0m                = "X86_64" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0menable_confidential_compute[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mimage[0m[0m                       = "https://www.googleapis.com/compute/v1/projects/rocky-linux-cloud/global/images/rocky-linux-8-v20250610" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mlabels[0m[0m                      = {} [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mprovisioned_iops[0m[0m            = 0 [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mprovisioned_throughput[0m[0m      = 0 [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mresource_policies[0m[0m           = [] [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0msize[0m[0m                        = 20 [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mtype[0m[0m                        = "pd-standard" [90m->[0m [0m[90mnull[0m[0m
            }
        }

      [31m-[0m [0mnetwork_interface {
          [31m-[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mname[0m[0m                        = "nic0" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mnetwork[0m[0m                     = "https://www.googleapis.com/compute/v1/projects/tonal-benefit-462606-b8/global/networks/default" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mnetwork_ip[0m[0m                  = "10.148.0.47" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mqueue_count[0m[0m                 = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mstack_type[0m[0m                  = "IPV4_ONLY" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msubnetwork[0m[0m                  = "https://www.googleapis.com/compute/v1/projects/tonal-benefit-462606-b8/regions/asia-southeast1/subnetworks/default" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msubnetwork_project[0m[0m          = "tonal-benefit-462606-b8" [90m->[0m [0m[90mnull[0m[0m

          [31m-[0m [0maccess_config {
              [31m-[0m [0m[1m[0mnat_ip[0m[0m       = "34.87.158.187" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mnetwork_tier[0m[0m = "PREMIUM" [90m->[0m [0m[90mnull[0m[0m
            }
        }

      [31m-[0m [0mscheduling {
          [31m-[0m [0m[1m[0mautomatic_restart[0m[0m   = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mavailability_domain[0m[0m = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmin_node_cpus[0m[0m       = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mon_host_maintenance[0m[0m = "MIGRATE" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mpreemptible[0m[0m         = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mprovisioning_model[0m[0m  = "STANDARD" [90m->[0m [0m[90mnull[0m[0m
        }

      [31m-[0m [0mshielded_instance_config {
          [31m-[0m [0m[1m[0menable_integrity_monitoring[0m[0m = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0menable_secure_boot[0m[0m          = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0menable_vtpm[0m[0m                 = true [90m->[0m [0m[90mnull[0m[0m
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_compute_firewall.allowing-http[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_firewall" "allowing-http" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdirection[0m[0m          = "INGRESS"
      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "allowing-http"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = "default"
      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000
      [32m+[0m [0m[1m[0mproject[0m[0m            = "tonal-benefit-462606-b8"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [
          [32m+[0m [0m"0.0.0.0/0",
        ]
      [32m+[0m [0m[1m[0mtarget_tags[0m[0m        = [
          [32m+[0m [0m"http-server",
        ]

      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"80",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
    }

[1m  # google_compute_firewall.allowing-https[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_firewall" "allowing-https" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdestination_ranges[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdirection[0m[0m          = "INGRESS"
      [32m+[0m [0m[1m[0menable_logging[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "allowing-https"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = "default"
      [32m+[0m [0m[1m[0mpriority[0m[0m           = 1000
      [32m+[0m [0m[1m[0mproject[0m[0m            = "tonal-benefit-462606-b8"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msource_ranges[0m[0m      = [
          [32m+[0m [0m"0.0.0.0/0",
        ]
      [32m+[0m [0m[1m[0mtarget_tags[0m[0m        = [
          [32m+[0m [0m"https-server",
        ]

      [32m+[0m [0mallow {
          [32m+[0m [0m[1m[0mports[0m[0m    = [
              [32m+[0m [0m"443",
            ]
          [32m+[0m [0m[1m[0mprotocol[0m[0m = "tcp"
        }
    }

[1m  # google_compute_instance.rocky_vms[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_instance" "rocky_vms" {
      [32m+[0m [0m[1m[0mcan_ip_forward[0m[0m       = false
      [32m+[0m [0m[1m[0mcpu_platform[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mcurrent_status[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m  = false
      [32m+[0m [0m[1m[0meffective_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0minstance_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmachine_type[0m[0m         = "e2-medium"
      [32m+[0m [0m[1m[0mmetadata[0m[0m             = {
          [32m+[0m [0m"ssh-keys" = <<-EOT
                penumarthigeetasri:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC5KYvAzc02uMX0vINcDeCekaUxMHS9kwVcC6qnLNOOHKfpYpXwUZu+NTF1o77X+U2y3nF/VB+vNmxgnh/30YbiAC375NLSpDQtfLBCAlzGaoK/iXHcaocUsgVk03nmN1NdqmAjz3OqErm9N/bqISOLtL3onSji2sMIHKz8dMSb/Svbwlo7SAi34GxD4bZL1FJo9/6KuR1s1YFAkooPUt8YWorgWgSHYY8kOOBxE9p5aEsIJ312rds/NpKp5nm/dAZdwvvRm1r4SF0xx5bCYOVA25/42jOEY5qJPPOoEItwPNmWwU2zFwfG7k58SEqmz5+McNb1fgd6AnTIw1yBx5zn penumarthigeeta@Penumarthis-MacBook-Pro.local
            EOT
        }
      [32m+[0m [0m[1m[0mmetadata_fingerprint[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                 = "rocky-vm2"
      [32m+[0m [0m[1m[0mproject[0m[0m              = "tonal-benefit-462606-b8"
      [32m+[0m [0m[1m[0mself_link[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = [
          [32m+[0m [0m"http-server",
          [32m+[0m [0m"https-server",
          [32m+[0m [0m"rocky",
        ]
      [32m+[0m [0m[1m[0mtags_fingerprint[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mterraform_labels[0m[0m     = {
          [32m+[0m [0m"goog-terraform-provisioned" = "true"
        }
      [32m+[0m [0m[1m[0mzone[0m[0m                 = "asia-southeast1-a"

      [32m+[0m [0mboot_disk {
          [32m+[0m [0m[1m[0mauto_delete[0m[0m                = true
          [32m+[0m [0m[1m[0mdevice_name[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mguest_os_features[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmode[0m[0m                       = "READ_WRITE"
          [32m+[0m [0m[1m[0msource[0m[0m                     = (known after apply)

          [32m+[0m [0minitialize_params {
              [32m+[0m [0m[1m[0marchitecture[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mimage[0m[0m                  = "rocky-linux-cloud/rocky-linux-8"
              [32m+[0m [0m[1m[0mlabels[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_iops[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mprovisioned_throughput[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mresource_policies[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0msize[0m[0m                   = 20
              [32m+[0m [0m[1m[0msnapshot[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mtype[0m[0m                   = (known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0mconfidential_instance_type[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [32m+[0m [0mguest_accelerator {
          [32m+[0m [0m[1m[0mcount[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0minternal_ipv6_prefix_length[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mipv6_address[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0mnetwork[0m[0m                     = "default"
          [32m+[0m [0m[1m[0mnetwork_attachment[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_ip[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mstack_type[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0msubnetwork_project[0m[0m          = (known after apply)

          [32m+[0m [0maccess_config {
              [32m+[0m [0m[1m[0mnat_ip[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mnetwork_tier[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mscheduling {
          [32m+[0m [0m[1m[0mautomatic_restart[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mavailability_domain[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0minstance_termination_action[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmin_node_cpus[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mon_host_maintenance[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mprovisioning_model[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mtermination_time[0m[0m            = (known after apply)

          [32m+[0m [0mlocal_ssd_recovery_timeout {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mmax_run_duration {
              [32m+[0m [0m[1m[0mnanos[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mseconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }

          [32m+[0m [0mon_instance_stop_action {
              [32m+[0m [0m[1m[0mdiscard_local_ssd[0m[0m = (known after apply)
            }
        }
    }

[0m[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0mvm_ip[0m[0m = "34.87.158.187" [33m->[0m [0m(known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://4e403e64400b:4141/lock?id=GeetaSree13%252Fterraform_ansible%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>


---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
